### Pandas

### Pandas Usecases
    * Data Transformation
    * Data Analysis
    * Data Cleaning
### Pandas Notations
    * series----Creating the data
    * DataFrame----For Making the data in a particular tabular format

In [1]:
import pandas as pd

In [6]:
internal1={'s1':20,'s2':10,'s3':30}
internal1=pd.Series(internal1)
print(internal1)
internal2={'s1':10,'s2':30,'s3':20}
internal2=pd.Series(internal2)
print(internal2)i

s1    20
s2    10
s3    30
dtype: int64
s1    10
s2    30
s3    20
dtype: int64

In [8]:
final={'internal1':internal1,'internal2':internal2}
final=pd.DataFrame(final)
                   
final

    internal1  internal2
s1         20         10
s2         10         30
s3         30         20

In [39]:
s1={'siri':10,'keerthi':20,'sireesha':30}
s1=pd.Series(s1)
print(s1)
s2={'siri':10,'keerthi':30,'sireesha':20}
s2=pd.Series(s2)
print(s2)

siri        10
keerthi     20
sireesha    30
dtype: int64
siri        10
keerthi     30
sireesha    20
dtype: int64

In [40]:
final={'s1':s1,'s2':s2}
final=pd.DataFrame(final)
final

          s1  s2
siri      10  10
keerthi   20  30
sireesha  30  20

In [21]:
s1=['10','20','30']
s1=pd.Series(s1)
print(s1)
s2=['10','30','20']
s2=pd.Series(s2)
print(s2)

0    10
1    20
2    30
dtype: object
0    10
1    30
2    20
dtype: object

In [26]:
final1={'name':name,'s1':s1,'s2':s2}
final1=pd.DataFrame(final)
final1

       name  s1  s2
0      siri  10  10
1   keerthi  20  30
2  sireesha  30  20

In [30]:
final.values

array([['10', '10'],
       ['20', '30'],
       ['30', '20']], dtype=object)

In [32]:
final.values[2]

array(['30', '20'], dtype=object)

In [33]:
final.values[2][1]

'20'

In [34]:
for i in final.values:
    print(i[0],i[1])

10 10
20 30
30 20

### To Add a row ----(loc)

In [49]:
final.loc['deepu']=[20,30]

In [50]:
final

          s1  s2
siri      10  10
keerthi   20  30
sireesha  40  50
s4        20  30
deepu     20  30

### To delete a row:------(drop)

In [51]:
final.drop('s4')

          s1  s2
siri      10  10
keerthi   20  30
sireesha  40  50
deepu     20  30

### To Update a table:

In [52]:
final.values[2]=[40,50]

In [53]:
final

          s1  s2
siri      10  10
keerthi   20  30
sireesha  40  50
s4        20  30
deepu     20  30

### Reading the csv files using pandas

In [58]:
import pandas as pd
income=pd.read_csv("income.csv")
income

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,47215,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [60]:
income.values

array([['04000US01', 'Alabama', 37150, 37952, 42212, 44476, 39980, 40933,
        42590, 43464, 41381],
       ['04000US02', 'Alaska', 55891, 56418, 62993, 63989, 61604, 57848,
        57431, 63648, 61137],
       ['04000US04', 'Arizona', 45245, 46657, 47215, 46914, 45739, 46896,
        48621, 47044, 50602],
       ['04000US05', 'Arkansas', 36658, 37057, 40795, 39586, 36538,
        38587, 41302, 39018, 39919],
       ['04000US06', 'California', 51755, 55319, 55734, 57014, 56134,
        54283, 53367, 57020, 57528]], dtype=object)

In [61]:
income.columns

Index(['GEOID', 'State', '2005', '2006', '2007', '2008', '2009', '2010',
       '2011', '2012', '2013'],
      dtype='object')

In [62]:
income.values[1][1]

'Alaska'

In [63]:
for i in income.values:
    print(i[1],' :',i[10])

Alabama  : 41381
Alaska  : 61137
Arizona  : 50602
Arkansas  : 39919
California  : 57528

In [65]:
s=0
for i in range(2,11):
    s+=income.values[2][i]
print(s)

424933